Repository: eunhyekoo/glo_project
Catalog: feedback/TMData/[Naver] [WEBTOON] Ganda: Night Defender.tmx
Source language: id
Languages: en

source: tapi...
en: but...

source: aku yang memilih untuk bisa menggunakan kekuatan madama.
en: I’m the one who’s using madama’s power.

source: rika akan bisa menggunakannya.
en: rika will be able to use it well

source: kami mau kembalikan saja kekuatan ini, kami tidak perlu.
en: just take your power back from us, we don’t need it.

source: karena aku akan mempersembahkan kekuatan madama pada manusia.
en: because I will give madama’s power to a human.

source: diam kau!
en: shut your mouth!

source: tapi apa mereka siap?
en: but are they ready?

source: pilihannya ada padamu.
en: the choice is yours.

source: faiz, sudah! simpan energimu!
en: faiz, enough! save your energy!

source: aku yang akan mengambil alih.
en: I’ll take it from here.

source: hilang, dalam kilatan cahaya. tapi...
en: There was a gleam of light, and then he vanished.

source: BAHANNYA UDAH LEBIH BAGUS DARI YANG KEMARIN.
en: The materials are much better than before.

source: TAPI AKU SIH SERING LIHAT, KALAU PULANG DARI KOS YUKI KAN AKU EMANG LEWAT SINI.
en: well, I actually see this quite often. I always take this route when I get back from yuki’s place.

source: tolong tahan para jinn ini!
en: so please hold off those jinns!

source: manusia seperti kalian tidak akan bisa menghancurkan kami!
en: ordinary humans like you will never defeat us!

source: OH, EM… BAIK.
en: oh, um... okay, sir.

source: MAAF!
en: sorry!

source: tapi kenapa aku tidak takut sama sekali?
en: why am I not afraid at all?

source: SANGAT DITUNGGU CERITA BERIKUTNYA KAK !!
en: I’m looking forward to your next work!

source: impian.
en: Your dream.

source: tidak... jangan...
en: no... it can’t be...

source: UWAH, SEMUA KAMPUS KELIHATAN DARI SINI, YA.
en: whoa, we can see the whole campus from here.

source: MANGGILNYA AJA TIBA-TIBA!
en: you should’ve told me before if you were planning to summon me!

source: aku akan pergi.
en: I need to go.

source: kau tidak pernah bisa menerima kekuatanku secara penuh.
en: you were not capable to receive my full power.

source: tentu saja, kami akan berbuat apa yang menurut kami terbaik. menurutku itu adil.
en: of course, I think it’s only fair that we will do what we think is best for us.

source: kalau bisa sih aku ingin seperti yuki, yang bisa sekolah di korea.
en: if I could choose, I want to study in korea just like yuki.

source: TAPI RIKA SADAR.
en: but then rika realizes.

source: aku akan menyelamatkan semuanya!
en: I will save them all!

source: Jangan pikirkan saya.
en: don’t mind me.

source: bodoh.
en: fool.

source: TERIMA KASIH SUDAH MEMBACA GANDA!
en: thanks for reading ganda: night defender!

source: selesai.
en: There you go.

source: aku tidak bisa menghentikan tekad rika.
en: I can’t stop her own will.

source: beraninya kau!!
en: how dare you!

source: cepat cari rika!
en: go find rika!

source: kumohon, zia... dengarlah!
en: please, zia, listen to me!

source: tidak! kamu berada dalam pengaruh madam!
en: no! you’re under her influence!

source: kau bodoh telah membuang tubuh ini begitu kau mendeteksi kelemahan, madama!
en: you’re a fool to get rid of this body just because you sensed a small weakness, madama!

source: ...takut?
en: frightened?

source: KADANG-KADANG SAYA JADI MERASA BERSALAH KARENA STORYBOARD SAYA GAMBARNYA JELEK DAN LINKA HARUS BERUSAHA KERAS BIAR ADEGAN AKSINYA TERLIHAT KEREN.
en: whenever we worked together, I felt kinda guilty since the sketch that I made for the storyboard was a bit off, and linka had to work harder to polish the action scenes into something cool.

source: SAMPAI JUMPA DI KESEMPATAN BERIKUTNYA!
en: see you next time!

source: tidak, mana nihaya?
en: no, where’s nihaya?

source: PENULIS AKAN MELANJUTKAN PROYEK LAINNYA (TERUTAMA PROYEK ADAPTASI SERIAL DARI WEBTOON-NYA YANG BERJUDUL CODE HELIX)
en: the writer will continue working on another project (especially on the adaptation of a webtoon serial entitled “code helix”).

source: SEMOGA KAU BISA MENEMUKAN APA YANG KAU CARI.
en: I hope you find what you’re looking for.

source: TANPA BELIAU, KARAKTER DI SINI BAKAL TERLIHAT JAUH LEBIH LEMAH DAN PLOTNYA MUNGKIN AKAN KE MANA-MANA.
en: without him, the characters in this comic would’ve been lacking so much, and the plot would’ve been all over the place.

source: kenapa?! kenapa kamu menerima kekuatan madama?!
en: why?! why did you accept madama’s power?!

source: tidak, dia masih hidup. dia masih di situ.
en: no, he’s alive. he’s there.

source: SO--SOALNYA!
en: b-because...

source: ke mana?
en: where to?

source: kurasa anda sudah tahu apa yang akan kami lakukan.
en: I think you already know what we’re about to do.

source: trik yang mungkin saja berhasil kalau kau menggunakannya pada jinn kelas rendah.
en: this trick might work on the weak ones.

source: aku dilewati?!
en: he jumped over me?!

source: jangan tunduk pada kekuatan ini, rika!
en: don’t succumb to this power, rika!

source: ini salah! ini bukan kekuatan rika! dia tidak bertarung seperti ini!
en: this is wrong! this isn’t rika’s power! she never fights like that!

source: KAMU PULANG DULU AJA.
en: It’s okay, you can go! I’ll catch up with you later.

source: ayo kita berangkat.
en: let’s go.

source: kalau kita sampai ke rika, jangan sentuh dia!
en: when we get to rika, don’t touch her!

source: AYO DUKUNG YA!
en: keep supporting us!

source: ibuku membolehkan aku lanjut ke s2, tapi ayahku mau aku langsung cari kerja dulu.
en: my mom wants me to get a master degree, but my dad asks me to find a job first.

source: sejak dahulu, manusia dan jinn hidup berbagi dunia.
en: since the beginning of time, humans and jinns have lived side by side.

source: a...pa...?
en: wh-what?

source: terormu berakhir hari ini.
en: your terror ends tonight!

source: aku tahu kita punya tujuan yang sama untuk bisa bertemu rika, tapi aku tidak akan membiarkanmu menyakitinya.
en: I know we have the same goal to find rika, but remember that I won’t let you hurt her.

source: DAN RIKA AKHIRNYA MELAKUKAN APA YANG SEBAGIAN BESAR MAHASISWA LAKUKAN…
en: so, rika decides to do what most of university students do...

source: kutukan ini berakhir bersamaku! aku orang terakhir yang harus berkorban demi kekuatan ini!
en: the curse must end with me! I should be the last person to bear the burden of this power!

source: ayo kita ke klinik!
en: let’s go to the clinic!

source: sepertinya kalian lupa siapa yang memberikan kalian kekuatan rantai itu.
en: you seem to forget who gave you the power of those chains.

source: padahal kita masih jauh dari aula.
en: we’re still quite far away from the hall.

source: (DESAIN AWAL GANDA DAN RIKA)
en: (the initial design of ganda and rika)

source: teman-temanmu sudah ada di luar sana. mereka rombongan yang unik.
en: your friends are out there right now. what an interesting group.

source: pergi... dari... sini...
en: get... away... from... here...

source: percayalah, aku juga tidak nyaman menggunakan kekuatan nihaya di kepala kita.
en: believe me, none of us is happy with using nihaya’s power into our head.

source: DAN TERAKHIR SAYA HARUS BERTERIMA KASIH PADA PEMBACA SETIA YANG MENEMANI DARI AWAL HINGGA AKHIR.
en: finally, I want to thank the readers who have read this comic from the beginning to the end.

source: KAU SUDAH MEMBANTU BANYAK SELAMA INI.
en: you’ve helped me so much, aksel.

source: Kekuatan tertinggi untuk melawan Nihaya sekarang ada di Ganda dan Rika.
en: Rika and Mr. Ganda are the only ones with the power to defeat Nihaya

source: HALO SEMUANYA!
en: hello, everyone!

source: ah.
en: oh.

source: tapi ingatlah kalau perjuangan kalian untuk menjaga umat manusia dari dirinya sendiri baru akan dimulai sekarang bisakah kalian melakukan itu?
en: but remember, your struggle to keep the humans from their own greed will begin sooner than you think. could you really do that?

source: kau pikir ada senjata yang bisa mengalahkan raja para jinn?
en: do you really think there’s a weapon that can defeat the king of all jinns?

source: luka yang dia terima adalah luka dalam, jadi tidak bisa banyak yang bisa aku lakukan.
en: he’s internally wounded, there’s pretty much nothing I can do.

source: tapi aku bisa mengubah keadaan.
en: but I can still turn the tables!

source: di mana?
en: where is he?

source: terima kasih, kalian sudah mengalahkan nihaya
en: thank you for defeating nihaya.

source: mustahil untuk menyelamatkan ganda tapi kamu masih bisa menyelamatkan teman- temanmu kalau kamu bertindak cepat.
en: it’s impossible to save ganda, but you can still save your friends if you act fast.

source: yang akan mereka lawan adalah...
en: They’ll face...

source: sejujurnya, sekarang ini kalian hanya lalat-lalat pengganggu.
en: honestly, both of you really annoy me, like flies during a hot day.

source: SELESAI!!
en: Done!!!

source: agh--!
en: argh!

source: aku... tidak bisa...
en: I... can’t...

source: aksel... membawa banyak jinn yang berbahaya ke tempat ini.
en: aksel has brought so many dangerous jinns to this place.

source: rika bukan masalah di sini.
en: rika isn’t the problem...

source: kubilang badut.
en: I said, “what a clown.”

source: dia akan baik-baik saja, tapi butuh waktu yang lama untuk pulih.
en: he’ll be fine, but he may need some time to recover.

source: jangan remehkan manusia!
en: never underestimate us humans!

source: hentikan lelucon kalian!
en: I’m done with this nonsense!

source: apa yang terjadi pada rika?
en: what happened to rika?

source: mereka diam saja di belakang...
en: they’ve been very quiet...

source: tidak menggunakannya sama saja dengan mengingkari alam.
en: refusing to harness this power is equal to go against nature.

source: kuharap begitu.
en: I hope so.

source: rikaa!!
en: rika!

source: efeknya terbatas, jadi cepat lakukan apa yang butuh kalian lakukan.
en: the effect won’t last long, though, so you have to finish your business quickly.

source: tapi aku adalah raja.
en: but, not on a king.

source: BAHWA RIKA MASIH ADA SEMESTER DEPAN.
en: she can just do it in the next semester!

source: aku hanya punya waktu beberapa menit lagi sebelum lenyap total.
en: I’m going to completely disappear in a few minutes.

source: belum lagi, kita mungkin akan berhadapan dengan nihaya... saya tidak mau kalian terlibat dalam bahaya lebih jauh.
en: Moreover, we may need to deal with nihaya later... I don’t want you guys to be involved in more danger.

source: kenapa kamu menggunakan tubuh rika?
en: why are you using rika’s body?

source: aku bisa memberimu kekuatan untuk mengendalikan jinn supaya keadaan bisa sesuai dengan yang kamu inginkan...
en: I can give you the power to control the jinns, so you can realize anything you ever wish for...

source: tapi aku tidak bisa mencegahnya.
en: but I can’t stop her.

source: permainan kalian berakhir di sini, manusia.
en: playtime is over, humans!

source: percuma. dia sudah mati.
en: You’re wasting your time. he’s already dead.

source: kami nggak jago menyerah!
en: we’re relentless!

source: serahkan tugas ini pada saya, bapak bisa melanjutkan kehidupan bapak.
en: let me handle everything from now on. you, on the other hand, can just get on with your life.

source: kamu punya teman-teman yang baik.
en: you have good friends.

source: KAU SENDIRI BAGAIMANA, AKSEL?
en: how about you, aksel?

source: Bukannya ini ulah Jinn?
en: It’s possible that a jinn is behind all this.

source: kau terlalu lemah, dhasa.
en: you were too weak, dhasa.

source: ini sudah malam, nihaya.
en: it’s already late, nihaya.

source: tapi kamu harus memilih.
en: but, you must make a decision.

source: percuma!
en: Fool!

source: rika, bertahanlah!
en: hang on, rika!

source: aku tahu aku harus melawannya.
en: I know I must defeat him.

source: tapi pasukan penyambut sudah datang.
en: but her welcoming army is already here.

source: Aku ingin menjadi lebih hebat lagi.
en: I want to be stronger.

source: rika, kamu terlambat.
en: you’re late, rika.

source: MASIH BANYAK HAL YANG INGIN SAYA LAKUKAN DI KOTA INI.
en: there’s a lot of things I still want to do in this city.

source: Kau sudah tidak punya kekuatan lagi untuk menghentikan kami.
en: you no longer have the power to stop us.

source: dia... memang agak aneh begitu sampai sini.
en: she’s been acting weird since we arrived here.

source: MAAF, PAK.
en: I’m sorry.

source: kau hanya menunda kehancuran kaummu sendiri!
en: You will only postpone the inevitable doom of your kind!

source: Kalian bawa crossbow saya, kan?
en: did you bring my crossbow?

source: oh, tentu. aku tidak akan meremehkan manusia.
en: oh, sure. I have no plan to look down on you humans!

source: tapi kami juga tidak akan berhenti untuk bergerak ke arah yang benar!
en: However, we will keep moving forward to find the right purpose!

source: pergi!!
en: go!

source: LALU, TERIMA KASIH JUGA KOSMIK YANG SUDAH MEMBERIKAN SAYA KESEMPATAN UNTUK MENULIS CERITA INI.
en: furthermore, I want to thank kosmik for giving me the opportunity to write this story.

source: dedeen!!
en: deden!

source: enak saja. siapa yang mengizinkan kau memakai tubuhku?
en: who gave you the permission to use my body?

source: bukan begitu, pak ganda?
en: isn’t that right, mr. ganda?

source: AKU…
en: I...

source: APAKAH TIDAK BERLEBIHAN KITA--
en: don’t you think it’s too much for--

source: nihaya mengambil tubuh ganda?!
en: is nihaya taking over his body?!

source: OKE!
en: got it!

source: BANYAK BAGIAN CERITA YANG BIKIN “WOWWW KOK BISA KEPIKIRANNNN”.
en: I caught myself thinking “wow, how did you come up with this???” so many times when I was reading the plot for this comic.

source: aku percaya padanya!
en: I trust her!

source: aksel juga di sini...
en: aksel is also here...

source: PAK GANDA CUMA MINTA AKU SIH, JADI HARUSNYA INI BUKAN MASALAH BESAR.
en: well, mr. ganda only called for me. I guess this shouldn’t be a big deal.

source: kalau deden... dia sih imajinasinya liar banget, pasti banyak tawaran kerja setelah kulus.
en: deden... well, he has such a wild imagination. I think he’ll get a lot of job offers after graduation.

source: kalian tidak bisa apa-apa tanpa kekuatan jinn.
en: humans are nothing without the jinn’s power.

source: TIDAK TERASA SUDAH SETAHUN KOMIK INI TERBIT, DAN BANYAK SEKALI YANG KITA LALUI YA.
en: it’s been a year since we released the comic, and we’ve been through a lot.

source: cepat juga.
en: that was quick.

source: seolah-olah...
en: It’s making...

source: terima kasih atas kerja kerasmu selama ini, ganda.
en: thank you for all your hard work, ganda.

source: pak ganda tidak mungkin kalah oleh jinn seperti ini!
en: mr. ganda won’t lose to a jinn like this!

source: SETELAH HASILNYA DI-FINISHING.
en: after linka polished it!

source: BUKAN KENCAN!
en: it wasn’t a date!

source: mau sampai kapan kau menahan diri, madama?
en: how long are you planning to you hold yourself back, madama?

source: NGOMONG AJA DONG!
en: come on, just say it!

source: Hanya sampai sinikah taktik kalian?
en: is this all you’ve got?

source: kalau aku menolak...
en: if I refuse...
